In [1]:
import pandas as pd

df=pd.read_csv("muck_data.csv")
## fetch the first 5 rows of the dataframe
df.head(5)

   id     name  age         city  purchase_amount
0   1    Alice   25     New York           120.50
1   2      Bob   30  Los Angeles           340.00
2   3  Charlie   22      Chicago            89.99
3   4    Diana   28      Houston           150.00
4   5    Ethan   35      Phoenix           220.75

In [2]:
df.tail(5)

   id    name  age          city  purchase_amount
5   6   Fiona   29  Philadelphia           410.00
6   7  George   40   San Antonio           310.25
7   8  Hannah   27     San Diego           270.10
8   9     Ian   32        Dallas           190.00
9  10   Julia   24      San Jose           130.60

In [3]:
df.describe()

             id        age  purchase_amount
count  10.00000  10.000000        10.000000
mean    5.50000  29.200000       223.219000
std     3.02765   5.391351       106.273873
min     1.00000  22.000000        89.990000
25%     3.25000  25.500000       135.450000
50%     5.50000  28.500000       205.375000
75%     7.75000  31.500000       300.212500
max    10.00000  40.000000       410.000000

In [4]:
df.dtypes

id                   int64
name                object
age                  int64
city                object
purchase_amount    float64
dtype: object

In [5]:
## Handling Missing Values
df.isnull()

      id   name    age   city  purchase_amount
0  False  False  False  False            False
1  False  False  False  False            False
2  False  False  False  False            False
3  False  False  False  False            False
4  False  False  False  False            False
5  False  False  False  False            False
6  False  False  False  False            False
7  False  False  False  False            False
8  False  False  False  False            False
9  False  False  False  False            False

In [7]:
df[df.isnull().any(axis=1)]
df.isnull().sum()

id                 0
name               0
age                0
city               0
purchase_amount    0
dtype: int64

In [10]:
zerofill=df.fillna(0)
zerofill.head()

   id     name  age         city  purchase_amount
0   1    Alice   25     New York           120.50
1   2      Bob   30  Los Angeles           340.00
2   3  Charlie   22      Chicago            89.99
3   4    Diana   28      Houston           150.00
4   5    Ethan   35      Phoenix           220.75

In [14]:
df.dtypes

id                   int64
name                object
age                  int64
city                object
purchase_amount    float64
dtype: object

In [15]:
df.rename(columns={"purchase_amount":"purchase_amount_new"},inplace=True)

In [16]:
df.head()

   id     name  age         city  purchase_amount_new
0   1    Alice   25     New York               120.50
1   2      Bob   30  Los Angeles               340.00
2   3  Charlie   22      Chicago                89.99
3   4    Diana   28      Houston               150.00
4   5    Ethan   35      Phoenix               220.75

In [18]:
## Change the data type of a column
df["Value_new"]=df["age"].astype(float)
df.head()
df.dtypes

## Drop a column
df.drop(columns=["Value_new"],inplace=True)
df.head()

   id     name  age         city  purchase_amount_new
0   1    Alice   25     New York               120.50
1   2      Bob   30  Los Angeles               340.00
2   3  Charlie   22      Chicago                89.99
3   4    Diana   28      Houston               150.00
4   5    Ethan   35      Phoenix               220.75

In [20]:
df['New Value']=df['age'].apply(lambda x: x*2)
df.head()

   id     name  age         city  purchase_amount_new  New Value
0   1    Alice   25     New York               120.50         50
1   2      Bob   30  Los Angeles               340.00         60
2   3  Charlie   22      Chicago                89.99         44
3   4    Diana   28      Houston               150.00         56
4   5    Ethan   35      Phoenix               220.75         70

In [23]:
## Data Aggregation and Grouping
grupped_mean=df.groupby("city")["purchase_amount_new"].mean()
grupped_mean.to_frame()

              purchase_amount_new
city
Chicago                     89.99
Dallas                     190.00
Houston                    150.00
Los Angeles                340.00
New York                   120.50
Philadelphia               410.00
Phoenix                    220.75
San Antonio                310.25
San Diego                  270.10
San Jose                   130.60

In [ ]:
grupped_sum=df.groupby(["city","name"])["purchase_amount_new"].sum()
grupped_sum.to_frame()

                      purchase_amount_new
city         name
Chicago      Charlie                89.99
Dallas       Ian                   190.00
Houston      Diana                 150.00
Los Angeles  Bob                   340.00
New York     Alice                 120.50
Philadelphia Fiona                 410.00
Phoenix      Ethan                 220.75
San Antonio  George                310.25
San Diego    Hannah                270.10
San Jose     Julia                 130.60

In [29]:
## Merging and Joining DataFrames
df1=pd.DataFrame({"id":[1,2,3,4,5],"name":["Alice","Bob","Charlie","David","Eva"]})
df2=pd.DataFrame({"id":[1,2,3,4,5],"age":[25,30,35,40,45]})
df1.head()

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David
4   5      Eva

In [30]:
df2.head()

   id  age
0   1   25
1   2   30
2   3   35
3   4   40
4   5   45

In [31]:
## Merge the two dataframes on the "key" column
pd.merge(df1,df2,on="id",how="inner")

   id     name  age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40
4   5      Eva   45

In [32]:
pd.merge(df1,df2,on="id",how="left")

   id     name  age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40
4   5      Eva   45

In [33]:
pd.merge(df1,df2,on="id",how="right")

   id     name  age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40
4   5      Eva   45